cmsis-svd/cmsis-svd/data/Spansion/MB9BF31xR_svd.xml
        <!-- REGISTER "PFR7" -->
        <register>
          <name>PFR7</name>
          <description>Port function setting register 7</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0000001F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P74" -->
            <field>
              <name>P74</name>
              <description>Bit4 of PFR7</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P73" -->
            <field>
              <name>P73</name>
              <description>Bit3 of PFR7</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P72" -->
            <field>
              <name>P72</name>
              <description>Bit2 of PFR7</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P71" -->
            <field>
              <name>P71</name>
              <description>Bit1 of PFR7</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P70" -->
            <field>
              <name>P70</name>
              <description>Bit0 of PFR7</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PFR8" -->
        <register>
          <name>PFR8</name>
          <description>Port function setting register 8</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P81" -->
            <field>
              <name>P81</name>
              <description>Bit1 of PFR8</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P80" -->
            <field>
              <name>P80</name>
              <description>Bit0 of PFR8</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PFRE" -->
        <register>
          <name>PFRE</name>
          <description>Port function setting register E</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0000000B</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PE3" -->
            <field>
              <name>PE3</name>
              <description>Bit3 of PFRE</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PE2" -->
            <field>
              <name>PE2</name>
              <description>Bit2 of PFRE</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PE0" -->
            <field>
              <name>PE0</name>
              <description>Bit0 of PFRE</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PCR0" -->
        <register derivedFrom="PFR0">
          <name>PCR0</name>
          <description>Pull-up Setting Register 0</description>
          <addressOffset>0x100</addressOffset>
        </register>
        <!-- REGISTER "PCR1" -->
        <register derivedFrom="PFR1">
          <name>PCR1</name>
          <description>Pull-up Setting Register 1</description>
          <addressOffset>0x104</addressOffset>
        </register>
        <!-- REGISTER "PCR2" -->
        <register derivedFrom="PFR2">
          <name>PCR2</name>
          <description>Pull-up Setting Register 2</description>
          <addressOffset>0x108</addressOffset>
        </register>
        <!-- REGISTER "PCR3" -->
        <register derivedFrom="PFR3">
          <name>PCR3</name>
          <description>Pull-up Setting Register 3</description>
          <addressOffset>0x10C</addressOffset>
        </register>
        <!-- REGISTER "PCR4" -->
        <register derivedFrom="PFR4">
          <name>PCR4</name>
          <description>Pull-up Setting Register 4</description>
          <addressOffset>0x110</addressOffset>
        </register>
        <!-- REGISTER "PCR5" -->
        <register derivedFrom="PFR5">
          <name>PCR5</name>
          <description>Pull-up Setting Register 5</description>
          <addressOffset>0x114</addressOffset>
        </register>
        <!-- REGISTER "PCR6" -->
        <register derivedFrom="PFR6">
          <name>PCR6</name>
          <description>Pull-up Setting Register 6</description>
          <addressOffset>0x118</addressOffset>
        </register>
        <!-- REGISTER "PCR7" -->
        <register derivedFrom="PFR7">
          <name>PCR7</name>
          <description>Pull-up Setting Register 7</description>
          <addressOffset>0x11C</addressOffset>
        </register>
        <!-- REGISTER "PCR8" -->
        <register derivedFrom="PFR8">
          <name>PCR8</name>
          <description>Pull-up Setting Register 8</description>
          <addressOffset>0x120</addressOffset>
        </register>
        <!-- REGISTER "PCRE" -->
        <register derivedFrom="PFRE">
          <name>PCRE</name>
          <description>Pull-up Setting Register E</description>
          <addressOffset>0x138</addressOffset>
        </register>
