cmsis-svd/cmsis-svd/data/Spansion/MB9BF31xR_svd.xml
        <!-- REGISTER "WTTR" -->
        <register>
          <name>WTTR</name>
          <description>Timer Setting Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TM17" -->
            <field>
              <name>TM17</name>
              <description>Bit17 of WTTR</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM16" -->
            <field>
              <name>TM16</name>
              <description>Bit16 of WTTR</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM15" -->
            <field>
              <name>TM15</name>
              <description>Bit15 of WTTR</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM14" -->
            <field>
              <name>TM14</name>
              <description>Bit14 of WTTR</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM13" -->
            <field>
              <name>TM13</name>
              <description>Bit13 of WTTR</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM12" -->
            <field>
              <name>TM12</name>
              <description>Bit12 of WTTR</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM11" -->
            <field>
              <name>TM11</name>
              <description>Bit11 of WTTR</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM10" -->
            <field>
              <name>TM10</name>
              <description>Bit10 of WTTR</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM9" -->
            <field>
              <name>TM9</name>
              <description>Bit9 of WTTR</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM8" -->
            <field>
              <name>TM8</name>
              <description>Bit8 of WTTR</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM7" -->
            <field>
              <name>TM7</name>
              <description>Bit7 of WTTR</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM6" -->
            <field>
              <name>TM6</name>
              <description>Bit6 of WTTR</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM5" -->
            <field>
              <name>TM5</name>
              <description>Bit5 of WTTR</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM4" -->
            <field>
              <name>TM4</name>
              <description>Bit4 of WTTR</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM3" -->
            <field>
              <name>TM3</name>
              <description>Bit3 of WTTR</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM2" -->
            <field>
              <name>TM2</name>
              <description>Bit2 of WTTR</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM1" -->
            <field>
              <name>TM1</name>
              <description>Bit1 of WTTR</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM0" -->
            <field>
              <name>TM0</name>
              <description>Bit0 of WTTR</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTCLKS" -->
        <register>
          <name>WTCLKS</name>
          <description>Clock Selection Register</description>
          <addressOffset>0x20</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WTCLKS" -->
            <field>
              <name>WTCLKS</name>
              <description>Input clock selection bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTCLKM" -->
        <register>
          <name>WTCLKM</name>
          <description>Selection Clock Status Register</description>
          <addressOffset>0x21</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WTCLKM" -->
            <field>
              <name>WTCLKM</name>
              <description>Clock selection status bit </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTCAL" -->
        <register>
          <name>WTCAL</name>
          <description>Frequency Correction Value Setting Register</description>
          <addressOffset>0x24</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x7F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WTCAL" -->
            <field>
              <name>WTCAL</name>
              <description>Frequency correction value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTCALEN" -->
        <register>
          <name>WTCALEN</name>
          <description>Frequency Correction Enable Register</description>
          <addressOffset>0x25</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WTCALEN" -->
            <field>
              <name>WTCALEN</name>
              <description>Frequency correction enable bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
